/// <summary>
/// Точка входа в приложение
/// </summary>

/// <summary>
/// Точка входа в приложение
/// </summary>
/// <param name="agrc">[in] Количество параметров командной строки</param>
/// <param name="argv">[in] Массив строк с нулевым символом в конце, представляющих аргументы командной строки</param>
/// <returns>Возвращает нулевое значение, если приложение было завершено без ошибок
/// и ненеулевое значение в противном случае</returns>
int main(int agrc, char* argv[])
{
    // TODO

    return 0;
}